src/Documents/ЗаказНаРемонт/ЗаказНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаРемонт</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>InformationRegister.ПланРемонтов</registerRecords>
  <registerRecords>InformationRegister.РемонтыРабочихЦентров</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.ПериодыАктуальностиОбъектовЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ТрудозатратыКОформлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВидРемонта</name>
    <type>
      <types>CatalogRef.ОбщиеВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтноеМероприятие</name>
    <type>
      <types>CatalogRef.РемонтныеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехРешение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныТрудозатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЗаказНаВнутреннееПотреблениеРабот</name>
    <comment>Технический признак того, что заказ формирует распоряжения на внутреннее потребление работ.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтныйЦикл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияЗарплаты</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗавершения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УстраняемыеДефекты</name>
    <attributes>
      <name>Дефект</name>
      <type>
        <types>DocumentRef.РегистрацияДефекта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.Бригады</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СтатусыОбъектовЭксплуатации/СтатусыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектовЭксплуатации</name>
  <enumValues>
    <name>ВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Ликвидирован</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/УзлыОбъектовЭксплуатации/УзлыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УзлыОбъектовЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ОбъектыЭксплуатации</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подкласс</name>
    <type>
      <types>CatalogRef.ПодклассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РемонтирующееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Расположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлияетНаДоступностьРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыУчетаНаработок</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенныйРесурс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникПараметра</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ЗаказНаРемонт/Forms/ФормаПодбораРемонтов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеПроизвольногоРемонта = НСтр("ru = '<произвольный ремонт>';
											|en = '<any R&M>'");
	
	Если Параметры.Свойство("ОбъектЭксплуатации") Тогда
		
		ОбъектЭксплуатации = Параметры.ОбъектЭксплуатации;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
	ЗаполнитьДеревоРемонтов();

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И Модифицированность Тогда
		
		Отказ = Истина;
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПеренестиРемонтыВДокумент", ЭтаФорма),
			НСтр("ru = 'Данные были изменены. Перенести изменения в документ?';
				|en = 'The data was modified. Migrate the changes to the document?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиРемонтыВДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтроки(Команда)
	ОтметитьЭлементыПоСтрокамДерева(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьСтроки(Команда)
	ОтметитьЭлементыПоСтрокамДерева(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтовОтмечен.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтов.ЭтоСтрокаВидаРемонта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтовПредставление.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтов.ЭтоСтрокаВидаРемонта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтов.ВидРемонта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ПредставлениеПроизвольногоРемонта"));

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиРемонтыВДокумент(Знач Результат=Неопределено, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Результат = КодВозвратаДиалога.Да;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		// Снятие модифицированности, т.к. перед закрытием признак проверяется.
		Модифицированность = Ложь;
		
		ПараметрыОповещения = ПараметрыОповещенияФормыДокумента();
		
		Закрыть();
		
		ОповеститьОВыборе(ПараметрыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует дерево ремонтов
//
&НаСервере
Процедура ЗаполнитьДеревоРемонтов()
	
	ДеревоРемонтов.ПолучитьЭлементы().Очистить();
	
	Если ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ДанныеЗаполнения.Узел КАК Справочник.УзлыОбъектовЭксплуатации) КАК Узел,
			|	ВЫРАЗИТЬ(ДанныеЗаполнения.ВидРемонта КАК Справочник.ВидыРемонтов) КАК ВидРемонта,
			|	ВЫРАЗИТЬ(ДанныеЗаполнения.СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов) КАК СтатьяРасходов,
			|	ВЫРАЗИТЬ(ДанныеЗаполнения.КодРемонта КАК ЧИСЛО(10, 0)) КАК КодРемонта
			|ПОМЕСТИТЬ ДанныеТаблицы
			|ИЗ
			|	&ДанныеЗаполнения КАК ДанныеЗаполнения
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Узел,
			|	ВидРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеЗаполнения.Узел,
			|	ДанныеЗаполнения.ВидРемонта,
			|	МАКСИМУМ(ДанныеЗаполнения.СтатьяРасходов) КАК СтатьяРасходов,
			|	МАКСИМУМ(ДанныеЗаполнения.КодРемонта) КАК КодРемонта
			|ПОМЕСТИТЬ ДанныеЗаполнения
			|ИЗ
			|	ДанныеТаблицы КАК ДанныеЗаполнения
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеЗаполнения.Узел,
			|	ДанныеЗаполнения.ВидРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Узлы.Родитель КАК Родитель,
			|	Узлы.Ссылка КАК Узел,
			|	Узлы.Класс КАК Класс
			|ПОМЕСТИТЬ Узлы
			|ИЗ
			|	Справочник.УзлыОбъектовЭксплуатации КАК Узлы
			|ГДЕ
			|	Узлы.Владелец = &ОбъектЭксплуатации
			|	И НЕ Узлы.ПометкаУдаления
			|	И Узлы.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовЭксплуатации.ВЭксплуатации))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Узел,
			|	Класс
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Узлы.Родитель КАК Родитель,
			|	Узлы.Узел КАК Узел,
			|	ВидыРемонтов.Владелец КАК Класс,
			|	ВидыРемонтов.Ссылка КАК ВидРемонта
			|ПОМЕСТИТЬ РемонтыУзлов
			|ИЗ
			|	Узлы КАК Узлы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРемонтов КАК ВидыРемонтов
			|		ПО Узлы.Класс = ВидыРемонтов.Владелец
			|			И (НЕ ВидыРемонтов.ПометкаУдаления)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Узлы.Родитель,
			|	Узлы.Узел,
			|	Узлы.Класс,
			|	ЗНАЧЕНИЕ(Справочник.ВидыРемонтов.ПустаяСсылка)
			|ИЗ
			|	Узлы КАК Узлы
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Класс,
			|	ВидРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РемонтыУзлов.Родитель КАК Родитель,
			|	РемонтыУзлов.Узел КАК Узел,
			|	РемонтыУзлов.Класс КАК Класс,
			|	РемонтыУзлов.ВидРемонта КАК ВидРемонта,
			|	ВЫБОР
			|		КОГДА ДанныеЗаполнения.Узел ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Отмечен,
			|	ЕСТЬNULL(ДанныеЗаполнения.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
			|	ЕСТЬNULL(ДанныеЗаполнения.КодРемонта, 0) КАК КодРемонта
			|ИЗ
			|	РемонтыУзлов КАК РемонтыУзлов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаполнения КАК ДанныеЗаполнения
			|		ПО РемонтыУзлов.Узел = ДанныеЗаполнения.Узел
			|			И РемонтыУзлов.ВидРемонта = ДанныеЗаполнения.ВидРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВидыРемонтов.Ссылка КАК ВидРемонта,
			|	ВЫБОР
			|		КОГДА ДанныеЗаполнения.КодРемонта ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Отмечен,
			|	ЕСТЬNULL(ДанныеЗаполнения.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
			|	ЕСТЬNULL(ДанныеЗаполнения.КодРемонта, 0) КАК КодРемонта
			|ИЗ
			|	Справочник.ОбъектыЭксплуатации КАК Объекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРемонтов КАК ВидыРемонтов
			|		ПО Объекты.Класс = ВидыРемонтов.Владелец
			|			И (НЕ ВидыРемонтов.ПометкаУдаления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаполнения КАК ДанныеЗаполнения
			|		ПО (ВидыРемонтов.Ссылка = ДанныеЗаполнения.ВидРемонта)
			|			И (ДанныеЗаполнения.Узел = ЗНАЧЕНИЕ(Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка))
			|ГДЕ
			|	Объекты.Ссылка = &ОбъектЭксплуатации
			|	И НЕ ВидыРемонтов.Владелец ЕСТЬ NULL 
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыРемонтов.ПустаяСсылка),
			|	ВЫБОР
			|		КОГДА ДанныеЗаполнения.КодРемонта ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ,
			|	ЕСТЬNULL(ДанныеЗаполнения.СтатьяРасходов, НЕОПРЕДЕЛЕНО),
			|	ЕСТЬNULL(ДанныеЗаполнения.КодРемонта, 0)
			|ИЗ
			|	Справочник.ОбъектыЭксплуатации КАК Объекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаполнения КАК ДанныеЗаполнения
			|		ПО (ДанныеЗаполнения.Узел = ЗНАЧЕНИЕ(Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка))
			|			И (ДанныеЗаполнения.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонтов.ПустаяСсылка))
			|ГДЕ
			|	Объекты.Ссылка = &ОбъектЭксплуатации");
		
		ИспользоватьУзлы = ПолучитьФункциональнуюОпцию("ИспользоватьУзлыОбъектовЭксплуатации");
		
		ТаблицаРемонтов = ПолучитьИзВременногоХранилища(Параметры.Таблицы.Ремонты);
		Если Не ИспользоватьУзлы Тогда
			ТаблицаРемонтов.ЗаполнитьЗначения(Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка(), "Узел");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ТаблицаРемонтов);
		
		ПакетРезультатов = Запрос.ВыполнитьПакет();
		
		СтрокиДерева = ДеревоРемонтов.ПолучитьЭлементы();
		
		// Добавление объекта эксплуатации, как корня дерева
		СтрокаОбъектаЭксплуатации = СтрокиДерева.Добавить();
		СтрокаОбъектаЭксплуатации.Представление = Строка(ОбъектЭксплуатации);
		СтрокаОбъектаЭксплуатации.ИндексКартинки = 1;
		
		СтрокиОбъектаЭксплуатации = СтрокаОбъектаЭксплуатации.ПолучитьЭлементы();
		
		// Заполнение видов ремонтов объекта
		Выборка = ПакетРезультатов[5].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаВидаРемонта = СтрокиОбъектаЭксплуатации.Вставить(0);
			СтрокаВидаРемонта.ИндексКартинки = 3;
			СтрокаВидаРемонта.Представление = Выборка.ВидРемонта;
			СтрокаВидаРемонта.ЭтоСтрокаВидаРемонта = Истина;
			ЗаполнитьЗначенияСвойств(СтрокаВидаРемонта, Выборка, "ВидРемонта, Отмечен, СтатьяРасходов, КодРемонта");
			
		КонецЦикла;
		
		Если ИспользоватьУзлы Тогда
			
			// Добавление узлов объекта эксплуатации и их видов ремонтов
			Выборка = ПакетРезультатов[4].Выбрать();
			
			СоответствиеСтрок = НовыйСоответствиеСтрок();
			СоответствиеСтрок.Вставить(Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка(), СтрокаОбъектаЭксплуатации.ПолучитьЭлементы());
			
			МассивОбходаВыборки = Новый Массив;
			МассивОбходаВыборки.Добавить(Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка());
			
			СчетОбходаВыборки = 0;
			Пока СчетОбходаВыборки < МассивОбходаВыборки.Количество() Цикл
				
				Выборка.Сбросить();
				СтруктураПоиска = Новый Структура("Родитель", МассивОбходаВыборки[СчетОбходаВыборки]);
				Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
					
					СтрокиУзла = СоответствиеСтрок.Получить(Выборка.Узел); // ДанныеФормыКоллекцияЭлементовДерева
					
					Если СтрокиУзла = Неопределено Тогда
						
						СтрокиРодителя = СоответствиеСтрок.Получить(МассивОбходаВыборки[СчетОбходаВыборки]); // ДанныеФормыКоллекцияЭлементовДерева
						
						НоваяСтрока = СтрокиРодителя.Добавить();
						НоваяСтрока.Представление = Строка(Выборка.Узел);
						НоваяСтрока.Узел = Выборка.Узел;
						НоваяСтрока.ИндексКартинки = 2;
						
						СтрокиУзла = НоваяСтрока.ПолучитьЭлементы();
						
						СоответствиеСтрок.Вставить(Выборка.Узел, СтрокиУзла);
						МассивОбходаВыборки.Добавить(Выборка.Узел);
						
					КонецЕсли;
					
					СтрокаВидаРемонта = СтрокиУзла.Вставить(0);
					СтрокаВидаРемонта.ИндексКартинки = 3;
					СтрокаВидаРемонта.Представление = Выборка.ВидРемонта;
					СтрокаВидаРемонта.ЭтоСтрокаВидаРемонта = Истина;
					ЗаполнитьЗначенияСвойств(СтрокаВидаРемонта, Выборка, "Узел, ВидРемонта, Отмечен, СтатьяРасходов, КодРемонта");
					
				КонецЦикла;
				
				СчетОбходаВыборки = СчетОбходаВыборки + 1;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//  
// Возвращаемое значение:
// Соответствие из КлючИЗначение:
// * Ключ - СправочникСсылка.УзлыОбъектовЭксплуатации
// * Значение - ДанныеФормыКоллекцияЭлементовДерева
&НаСервере
Функция НовыйСоответствиеСтрок()
	Возврат Новый Соответствие();
КонецФункции

// Процедура рекурсивного обхода дерева с копированием данным отмеченных строк
//
&НаСервере
Процедура ДополнитьТаблицуПоСтрокамДерева(Таблица, Знач Строки=Неопределено)
	
	Если Строки = Неопределено Тогда
		Строки = ДеревоРемонтов.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.ЭтоСтрокаВидаРемонта Тогда
			Если Строка.Отмечен Тогда
				ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка);
			КонецЕсли;
		Иначе
			ДополнитьТаблицуПоСтрокамДерева(Таблица, Строка.ПолучитьЭлементы());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура рекурсивно выставляет флаг "Отмечен" на заданное значение в строках дерева ремонтов.
//
&НаСервере
Процедура ОтметитьЭлементыПоСтрокамДерева(Отмечен, Знач Строки=Неопределено)
	
	Если Строки = Неопределено Тогда
		Строки = ДеревоРемонтов.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.ЭтоСтрокаВидаРемонта Тогда
			Строка.Отмечен = Отмечен;
		Иначе
			ОтметитьЭлементыПоСтрокамДерева(Отмечен, Строка.ПолучитьЭлементы());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает заполненные параметры оповещения формы документа заказа на ремонт
//
// Возвращаемое значение:
// 		Структура - Структура параметров оповещения.
//
&НаСервере
Функция ПараметрыОповещенияФормыДокумента()
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВыполняемаяОперация", "ПодборРемонтов");
	ПараметрыОповещения.Вставить("Таблицы", Новый Структура);
	
	ТаблицаРемонтов = Новый ТаблицаЗначений;
	ТаблицаРемонтов.Колонки.Добавить("Узел", Новый ОписаниеТипов("СправочникСсылка.УзлыОбъектовЭксплуатации"));
	ТаблицаРемонтов.Колонки.Добавить("ВидРемонта", Новый ОписаниеТипов("СправочникСсылка.ВидыРемонтов"));
	ТаблицаРемонтов.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ТаблицаРемонтов.Колонки.Добавить("КодРемонта", Новый ОписаниеТипов("Число"));
	
	ДополнитьТаблицуПоСтрокамДерева(ТаблицаРемонтов);
	
	ПараметрыОповещения.Таблицы.Вставить("Ремонты", ПоместитьВоВременноеХранилище(ТаблицаРемонтов));
	
	Возврат ПараметрыОповещения;
	
КонецФункции

#КонецОбласти
